insert into genre
values
	(1,'rock'),
	(2,'pop music'),
	(3,'hip-hop'),
	(4,'electronic'),
	(5,'classical');

insert into singer
values
	(1,'Linkin park'),
	(2,'Evanescence'),
	(3,'Eminem'),
	(4,'Madonna'),
	(5,'Би 2'),
	(6,'ДДТ'),
	(7,'Tiesto'),
	(8,'Кипелов'),
	(9,'Сплин'),
	(10,'Владимир Кузьмин');

insert into album 
values
	(1,'Meteora', '2003'),
	(2,'Fallen', '2003'),
	(3,'Recovery', '2010'),
	(4,'Something to Remember', '1995'),
	(5,'Горизонт событий', '2018'),
	(6,'Иначе', '2011'),
	(7,'Just Be', '2004'),
	(8,'Путь наверх', '2003'),
	(9,'Гранатовый альбом', '1998'),
	(10,'Лучшие песни', '2007');

insert into compilation  
values
	(1,'Сборник №1', '2018'),
	(2,'Сборник №2', '2018'),
	(3,'Сборник №3', '2019'),
	(4,'Сборник №4', '2019'),
	(5,'Сборник №5', '2020'),
	(6,'Сборник №6', '2020'),
	(7,'Сборник №7', '2021'),
	(8,'Сборник №8', '2021'),
	(9,'Сборник №9', '2022'),
	(10,'Сборник №10', '2022');

insert into track (album_id, name, duration)
values
	(1, 'Somewhere I belong', 3.33),
	(1, 'Breaking the habbit', 3.15),
	(2, 'Breaking the habbit', 3.57),
	(2, 'My importal', 4.26),
	(3, 'Not Afraid', 4.10),
	(3, 'Going Through Changes', 4.57)
	(4, 'You will See', 4.39),
	(5, 'Виски', 2.47)
	(5, 'Лайки', 3.28),
	(6, 'Песня о свободе', 6.15),
	(7, 'Just Be', 3.55)
	(7, 'Traffic', 4.17),
	(8, 'Герой асфальта', 5.58)
	(8, 'Закат', 2.38),
	(9, 'Орбит без сахара', 2.17)
	(9, 'Весь этот бред', 3.08),
	(10, '5 минут от дома твоего', 5.22)
	(10, 'Огонёк', 4.47);

insert into singergenre 
values
	(1, 1),
	(1, 2),
	(1, 5),
	(1, 6),
	(1, 8),
	(1, 9),
	(2, 4),
	(2, 2),
	(2, 10),
	(3, 1),
	(3, 3),
	(4, 1),
	(4, 7);

insert into trackcompilation  
values
	(8, 1),
	(9, 1),
	(17, 1),
	(18, 1),
	(13, 2),
	(14, 2),
	(10, 2),
	(8, 2),
	(7, 3),
	(10, 3),
	(17, 3),
	(18, 3),
	(1, 4),
	(2, 4),
	(3, 4),
	(4, 4),
	(1, 5),
	(2, 5),
	(5, 5),
	(6, 5),
	(13, 6),
	(14, 6),
	(1, 6),
	(2, 6),
	(13, 7),
	(4, 7),
	(11, 7),
	(12, 7),
	(5, 8),
	(6, 8),
	(15, 8),
	(16, 8);

insert into singeralbum 
values
	(1, 1),
	(2, 2),
	(3, 3),
	(4, 4),
	(5, 5),
	(6, 6),
	(7, 7),
	(8, 8),
	(9, 9),
	(10, 10);


